Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/shijing__guofeng-beifeng-006__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 擊鼓其鏜，踴躍用兵，土國城漕，我獨南行。
en: Hear the roll of our drums! See how we leap about, using our weapons! Those do the fieldwork in the State, or fortify Tsou, While we alone march to the south.

source: 從孫子仲，平陳與宋，不我以歸，憂心有忡。
en: We followed Sun Tsze-chung, Peace having been made with Ch'in and Sung; [But] he did not lead us back, And our sorrowful hearts are very sad.

source: 爰居爰處，爰喪其馬，于以求之，于林之下。
en: Here we stay; here we stop; Here we lose our horses; And we seek for them, Among the trees of the forest.

source: 死生契闊，與子成說，執子之手，與子偕老。
en: For life or for death, however separated, To our wives we pledged our word. We held their hands; — We were to grow old together with them.

source: 于嗟闊兮，不我活兮，于嗟洵兮，不我信兮。
en: Alas for our separation! We have no prospect of life. Alas for our stipulation! We cannot make it good.
